[
  {
    "topic": "Реляционная модель данных",
    "description": "Основы реляционной модели: определения отношений, кортежей, атрибутов, схем, внешних ключей, связей и проблем нормализации.",
    "subtopic": [
      "Определение реляционной базы данных и её основы на математическом понятии 'отношение'",
      "Понятие отношения: схема и тело, кортежи как экземпляры объектов",
      "Атрибуты, домены и уникальность имён атрибутов",
      "Связи между отношениями через внешние ключи",
      "Пример реляционной БД: связи 'многие ко многим' с ассоциативной таблицей (фильмы и актёры)",
      "Изменение схемы и экземпляров в реляционных БД",
      "Нормализация: борьба с избыточностью и проблемы с соединениями таблиц",
      "Структурные аспекты: отношения, кортежи, атрибуты"
    ]
  },
  {
    "topic": "Системы управления базами данных (СУБД)",
    "description": "Обзор понятия СУБД, клиент-серверной архитектуры, её преимуществ и недостатков, встраиваемых СУБД, управления параллельностью, целостностью и безопасностью данных.",
    "subtopic": [
      "Понятие и назначение СУБД",
      "Преимущества клиент-серверных СУБД",
      "Недостатки клиент-серверных СУБД",
      "Встраиваемые СУБД и их особенности",
      "Управление параллельностью и многопользовательским доступом",
      "Поддержка целостности, безопасности и восстановления данных",
      "Системный каталог и метаданные в СУБД"
    ]
  },
  {
    "topic": "Реляционная модель данных и альтернативы",
    "description": "Обзор реляционной модели данных, её преимуществ, недостатков, сравнение с иерархической, сетевой, объектной и документоориентированными моделями, а также введение в слабоструктурированные данные и большие данные.",
    "subtopic": [
      "Понятие больших данных",
      "Реляционная модель базы данных",
      "Преимущества реляционных СУБД",
      "Недостатки реляционной модели (потеря соответствия, сложность масштабирования)",
      "Иерархическая и сетевая модели данных",
      "Объектные и объектно-реляционные базы данных",
      "Слабоструктурированные данные",
      "Сравнение реляционных и документоориентированных БД"
    ]
  },
  {
    "topic": "ER-моделирование баз данных",
    "description": "Процесс создания концептуальной и физической ER-диаграмм, выделение сущностей, атрибутов и связей, нормализация отношений на примере системы оптовой торговли с использованием MySQL Workbench.",
    "subtopic": [
      "Получение информации о предметной области: список сущностей, атрибутов и связей",
      "Итеративное уточнение ER-диаграммы через опрос экспертов",
      "Определение и отображение связей (один-ко-многим, многие-ко-многим)",
      "Разделение связей многие-ко-многим с помощью промежуточных сущностей",
      "Добавление атрибутов и модальности связей",
      "Создание концептуальной ER-диаграммы",
      "Построение физической ER-диаграммы с учетом особенностей СУБД (типы полей, внешние ключи)",
      "Нормализация таблиц для устранения избыточности данных"
    ]
  },
  {
    "topic": "Связи между кортежами отношений",
    "description": "Внешние ключи для реализации связей между таблицами в реляционной модели: типы 'один-к-одному', 'один-ко-многим', 'многие-ко-многим', свойства ключей и примеры.",
    "subtopic": [
      "Роль внешних ключей в связях между таблицами",
      "Тип связи 'один к одному': примеры и реализация",
      "Тип связи 'один ко многим': примеры (отделы-сотрудники)",
      "Тип связи 'многие ко многим': промежуточные таблицы",
      "Свойства внешних ключей: простые/составные, домены, уникальность",
      "Родительские и дочерние таблицы в связях"
    ]
  },
  {
    "topic": "Ссылочная целостность",
    "description": "Правила обеспечения согласованности внешних ключей с первичными ключами родительских отношений; анализ нарушений при операциях вставки, обновления и удаления в родительских и дочерних отношениях.",
    "subtopic": [
      "Определение ссылочной целостности: внешние ключи не должны ссылаться на несуществующие кортежи родительского отношения",
      "Родительское и дочернее отношения: тип 'один-ко-многим', свойства внешних ключей (NULL только вне PK, не обязательно PK)",
      "Операции в родительском отношении: вставка (не нарушает), обновление (может нарушить при изменении PK), удаление (нарушает при ссылках FK)",
      "Операции в дочернем отношении: вставка (нарушает при некорректном FK), обновление (нарушает при изменении FK на несуществующий), удаление (не нарушает)"
    ]
  },
  {
    "topic": "Реляционные операции",
    "description": "Операции реляционной алгебры для работы с отношениями: объединение, пересечение, вычитание, деление, декартово произведение и соединение, с примерами на таблицах студентов, преподавателей и дисциплин.",
    "subtopic": [
      "Объединение (Union)",
      "Пересечение (Intersection)",
      "Вычитание (Difference)",
      "Деление (Division)",
      "Декартово произведение (Cartesian Product)",
      "Соединение (Join)"
    ]
  },
  {
    "topic": "Введение в SQL",
    "description": "Обзор истории развития SQL как декларативного языка для работы с реляционными базами данных: базовые операции, стандарты, эволюция, преимущества и недостатки.",
    "subtopic": [
      "Изначальные операции SQL: создание таблиц, добавление/изменение/удаление записей, выборка данных, изменение структуры",
      "Эволюция SQL: усложнение языка, поддержка хранимых объектов (индексы, представления, триггеры, процедуры)",
      "История стандартизации: ANSI/ISO 1986, SQL:92 и последующие версии",
      "Диалекты SQL: различия между СУБД, отступления от стандарта и проблемы совместимости",
      "Преимущества SQL: независимость от СУБД, наличие стандартов, декларативность",
      "Недостатки SQL: диалекты, сложность работы с иерархическими структурами"
    ]
  },
  {
    "topic": "Целочисленные и вещественные типы данных MySQL",
    "description": "Обзор целочисленных типов (TINYINT, INT и др.), их диапазонов, signed/unsigned, битовых типов и вещественных чисел (FLOAT, DOUBLE, DECIMAL) с рекомендациями по выбору.",
    "subtopic": [
      "Целочисленные типы: TINYINT, SMALLINT, MEDIUMINT, INT, BIGINT и их размеры (8-64 бита)",
      "Диапазоны значений: signed от –2^(N–1) до 2^(N–1)–1, unsigned от 0 до удвоенного максимума",
      "Битовые типы данных: компактное хранение битов, технически строковые",
      "Вещественные типы: FLOAT (4 байта), DOUBLE (8 байт), DECIMAL для точных вычислений (финансы)",
      "Выбор оптимального типа: учитывать диапазон, точность, пространство и производительность"
    ]
  },
  {
    "topic": "VARCHAR и CHAR в базах данных",
    "description": "Сравнение строковых типов данных VARCHAR (переменной длины) и CHAR (фиксированной длины): хранение на диске и в памяти (InnoDB), использование места, дополнение пробелами, преимущества и сценарии применения.",
    "subtopic": [
      "Определение и хранение типа CHAR: фиксированная длина, дополнение пробелами",
      "Определение и хранение типа VARCHAR: переменная длина, дополнительные байты для длины (1 или 2 байта)",
      "Различия в использовании дискового пространства и памяти",
      "Преимущества CHAR: для коротких фиксированных строк (MD5, Y/N), эффективность при обновлениях, отсутствие фрагментации",
      "Преимущества VARCHAR: экономия места для коротких значений, но возможная фрагментация при обновлениях",
      "Сравнение производительности и рекомендации по выбору типа"
    ]
  },
  {
    "topic": "ENUM в MySQL",
    "description": "Особенности хранения, сортировки, производительности и лучших практик использования типа данных ENUM в MySQL, включая внутреннее представление как целых чисел и оптимизацию таблиц.",
    "subtopic": [
      "Внутреннее хранение ENUM: упаковка в 1-2 байта как целые числа по позициям в списке",
      "Двойственная природа: извлечение в числовом и строковом контексте",
      "Сортировка ENUM: по внутренним числам, а не строкам; решения с порядком значений или FIELD()",
      "Накладные расходы: преобразования в строки при сравнениях и соединениях",
      "Производительность соединений: медленнее с CHAR/VARCHAR; преимущества для InnoDB с PK",
      "Рекомендации: одинаковые типы в связанных таблицах, избегать числовых констант в ENUM",
      "Пример оптимизации: преобразование VARCHAR в ENUM для уменьшения размера таблицы и индексов"
    ]
  },
  {
    "topic": "Модификация таблиц и внешние ключи в SQL",
    "description": "Команды ALTER TABLE для изменения структуры таблиц, управления ограничениями и внешними ключами, опции ON DELETE/ON UPDATE, TRUNCATE и DROP TABLE.",
    "subtopic": [
      "Синтаксис команды ALTER TABLE: ADD, DROP COLUMN, MODIFY COLUMN, ALTER COLUMN SET DEFAULT",
      "Параметры RESTRICT и CASCADE при удалении столбцов и ограничений",
      "Добавление и удаление ограничений (ADD/DROP CONSTRAINT)",
      "Команда TRUNCATE TABLE для очистки таблицы",
      "Команда DROP TABLE для удаления таблицы",
      "Создание внешних ключей (FOREIGN KEY REFERENCES)",
      "Опции ON DELETE и ON UPDATE: CASCADE, SET NULL, RESTRICT, NO ACTION, SET DEFAULT"
    ]
  },
  {
    "topic": "Операции JOIN в SQL",
    "description": "Изучение синтаксиса и типов соединений таблиц в SQL: INNER JOIN, OUTER JOIN (LEFT, RIGHT, FULL), NATURAL JOIN, JOIN USING, с примерами и особенностями использования.",
    "subtopic": [
      "Внутреннее соединение (INNER JOIN или JOIN с ON)",
      "Внешние соединения: LEFT JOIN (левое внешнее)",
      "Внешние соединения: RIGHT JOIN (правое внешнее)",
      "Полное внешнее соединение (FULL OUTER JOIN)",
      "Естественное соединение (NATURAL JOIN)",
      "Соединение с USING (JOIN ... USING)",
      "Использование псевдонимов таблиц",
      "Анти-джойны с WHERE ... IS NULL",
      "Комплексные запросы с фильтрацией, сортировкой и последовательностью таблиц"
    ]
  },
  {
    "topic": "Подзапросы в SQL (EXISTS, IN, ALL/ANY)",
    "description": "Изучение подзапросов в предложении WHERE: типы, правила, операторы EXISTS, IN, ALL/ANY/SOME, BETWEEN для фильтрации данных.",
    "subtopic": [
      "Предложение WHERE и типы ограничений (сравнение, диапазон, шаблоны, NULL, существование)",
      "Типы подзапросов: скалярные и табличные",
      "Правила и ограничения подзапросов",
      "Оператор EXISTS: синтаксис и эффективность",
      "Оператор IN: проверка на принадлежность множеству",
      "Многократное сравнение: предикаты ALL и ANY/SOME",
      "Оператор BETWEEN: проверка диапазона значений"
    ]
  },
  {
    "topic": "Обновляемые представления и DML в SQL",
    "description": "Изучение вставки данных (INSERT), создания обновляемых представлений (VIEW) с CHECK OPTION (LOCAL/CASCADED), удаления (DELETE/TRUNCATE) и введения в индексирование на примерах MySQL.",
    "subtopic": [
      "Добавление данных с помощью INSERT INTO",
      "Создание демонстрационной таблицы products",
      "Понятие представления (VIEW) как результата SELECT",
      "Создание простого обновляемого представления",
      "WITH CHECK OPTION: LOCAL и CASCADED для проверки WHERE",
      "Вложенные представления и проверка условий",
      "Удаление данных: DELETE с WHERE и без",
      "TRUNCATE TABLE: отличия от DELETE",
      "Введение в индексирование таблиц"
    ]
  },
  {
    "topic": "2NF и 3NF в нормализации БД",
    "description": "Приведение отношений к второй (2NF) и третьей (3NF) нормальным формам: устранение частичных и транзитивных зависимостей на примере отношения СОТРУДНИКИ_ОТДЕЛЫ_ПРОЕКТЫ с декомпозицией на несколько таблиц.",
    "subtopic": [
      "Определение потенциального ключа и его свойства",
      "Функциональные зависимости в исходном отношении",
      "Проверка на 2NF: устранение зависимостей неключевых атрибутов от части составного ключа",
      "Декомпозиция для 2NF (вынос зависимых атрибутов в отдельные отношения)",
      "Проверка на 3NF: устранение транзитивных зависимостей между неключевыми атрибутами",
      "Декомпозиция для 3NF (на СОТРУДНИКИ, ОТДЕЛЫ, ПРОЕКТЫ, ЗАДАЧИ)"
    ]
  },
  {
    "topic": "Транзакции в MySQL",
    "description": "Основы транзакций в MySQL: атомарность, проблемы смешивания подсистем хранения (InnoDB и MyISAM), уровни изоляции, блокировки и управление транзакциями.",
    "subtopic": [
      "Определение транзакций и их атомарность",
      "Проблемы смешивания транзакционных и нетранзакционных таблиц",
      "Уровни изоляции (REPEATABLE READ и фантомное чтение)",
      "Блокировки в InnoDB: двухфазный протокол и построчные блокировки",
      "Архитектура блокировок в подсистемах хранения MySQL",
      "Явное и неявное управление транзакциями"
    ]
  },
  {
    "topic": "Хранимые процедуры и функции в MySQL",
    "description": "Синтаксис создания, параметров, характеристик, вызова, изменения и удаления хранимых процедур и функций в MySQL, с примерами и различиями от триггеров.",
    "subtopic": [
      "Синтаксис создания хранимой процедуры (CREATE PROCEDURE)",
      "Параметры процедур (IN, OUT, INOUT) и их типы",
      "Характеристики процедур (DETERMINISTIC, CONTAINS SQL и др.)",
      "Тело процедуры (routine_body) и составные операторы (BEGIN...END)",
      "Пример создания и вызова процедуры (CALL)",
      "Синтаксис создания функции (CREATE FUNCTION) и RETURNS",
      "Различия процедур и функций: вызов в SELECT, RETURN",
      "Пример функции с циклом и агрегацией",
      "Изменение процедур и функций (ALTER PROCEDURE/FUNCTION)",
      "Удаление процедур и функций (DROP PROCEDURE/FUNCTION)",
      "Краткий обзор триггеров как автоматических процедур"
    ]
  },
  {
    "topic": "Триггеры в MySQL и PostgreSQL",
    "description": "Триггеры для обеспечения целостности данных: назначение, синтаксис создания в MySQL и PostgreSQL, события, переменные OLD/NEW, примеры и правила срабатывания.",
    "subtopic": [
      "Назначение триггеров: обеспечение целостности данных, отличия от хранимых процедур",
      "Синтаксис создания триггера в MySQL (CREATE TRIGGER, trigger_time, trigger_event, trigger_order)",
      "Времена срабатывания (BEFORE/AFTER) и события (INSERT/UPDATE/DELETE)",
      "Порядок выполнения триггеров (FOLLOWS/PRECEDES)",
      "Контекстные переменные OLD и NEW для доступа к данным",
      "Пример триггера в MySQL: проверка валидности данных в таблице orders",
      "Синтаксис создания триггера в PostgreSQL (CREATE TRIGGER с BEFORE/AFTER/INSTEAD OF)",
      "Правила срабатывания нескольких триггеров: цепочка BEFORE → AFTER, откат транзакции при ошибке"
    ]
  },
  {
    "topic": "Оптимизация LIMIT и OFFSET",
    "description": "Проблемы производительности пагинации с LIMIT и OFFSET в SQL, методы оптимизации с индексами, анализ EXPLAIN, метрики сортировки и работа оптимизатора запросов.",
    "subtopic": [
      "Проблемы больших OFFSET: генерация и отбрасывание строк",
      "Оптимизация смещения с покрывающими индексами",
      "Анализ EXPLAIN: rows, filtered, Extra (Using index)",
      "Метрики сортировки: SORT_MERGE_PASSES, SORT_RANGE, SORT_ROWS",
      "Работа оптимизатора: пространство поиска и n-факториал",
      "Синтаксис LIMIT/OFFSET в MySQL, PostgreSQL и TOP в SQL Server"
    ]
  },
  {
    "topic": "Оптимизация MySQL: LIMIT и обработка результатов",
    "description": "Объяснение механизма генерации и отправки результатов запросов в MySQL, важность LIMIT для избежания ненужных вычислений, поведение клиентских библиотек и освобождение ресурсов сервера.",
    "subtopic": [
      "Поэтапная генерация и отправка результатов запросов MySQL",
      "Преимущества потоковой передачи строк клиенту",
      "Проблемы выборки без LIMIT: полный набор и отбрасывание клиентом",
      "Использование LIMIT для остановки после нужного количества строк",
      "EXPLAIN для оценки объема результатов без LIMIT",
      "Буферизация результирующего набора в клиентских библиотеках",
      "Состояние 'отправка данных' и удержание ресурсов сервера",
      "Необходимость полного получения результатов для освобождения ресурсов"
    ]
  },
  {
    "topic": "Оптимизация запросов MySQL",
    "description": "Изучение принципов выполнения запросов в MySQL, механизмов оптимизации, причин медленной работы и способов повышения производительности через понимание оптимизатора и плана выполнения.",
    "subtopic": [
      "Основные принципы выполнения запросов",
      "Почему запросы бывают медленными: оптимизация доступа к данным",
      "Оптимизатор соединений и порядок выполнения",
      "Использование STRAIGHT_JOIN для контроля плана",
      "Построение дерева плана выполнения с минимальными затратами",
      "Типичные шаблоны оптимизации запросов",
      "Связь с дизайном схемы, индексами и временем отклика",
      "Временные таблицы и их влияние на производительность"
    ]
  },
  {
    "topic": "Оптимизация MySQL запросов индексами",
    "description": "Изучение роли индексов в повышении производительности запросов: типы доступа данных (ref vs ALL), анализ EXPLAIN, покрывающие индексы, сортировка ORDER BY/LIMIT и избежание избыточных индексов на примерах базы Sakila.",
    "subtopic": [
      "Последствия отсутствия индекса: полное сканирование таблицы (type: ALL)",
      "Анализ плана выполнения запроса с помощью EXPLAIN",
      "Типы доступа к данным и оценка количества строк (rows, filtered)",
      "Эффективное применение WHERE с индексами",
      "Использование индексов для сортировки (ORDER BY, LIMIT)",
      "Покрывающие индексы (Using index в Extra)",
      "Оптимизация соединений (JOIN) и порядка таблиц",
      "Избыточные и дублирующиеся индексы: предупреждения и проблемы"
    ]
  },
  {
    "topic": "Оптимизация индексов в MySQL",
    "description": "Стратегии повышения производительности запросов с помощью индексов: кластерные и покрывающие индексы, слияние индексов, оптимизация таблиц в InnoDB.",
    "subtopic": [
      "Проблемы неоптимальных индексов и альтернативы (покрывающие индексы)",
      "Слияние индексов (index merge)",
      "Оптимизация таблиц командой OPTIMIZE TABLE",
      "Покрывающие индексы в InnoDB и их преимущества",
      "Кластерные индексы: структура и быстрый доступ к данным",
      "Принципы выбора и использования B-дерево индексов"
    ]
  },
  {
    "topic": "Динамическая настройка переменных MySQL",
    "description": "Способы динамического изменения системных переменных MySQL (sort_buffer_size, join_buffer_size и др.), области видимости, сохранение настроек и побочные эффекты.",
    "subtopic": [
      "Способы установки переменных: SET, GLOBAL, SESSION",
      "Глобальные и сеансовые области видимости",
      "Сохранение изменений: конфигурационный файл и SET PERSIST",
      "Проверка изменений: SHOW GLOBAL VARIABLES",
      "Специальное значение DEFAULT для сброса",
      "Примеры переменных: max_connections, sort_buffer_size, join_buffer_size",
      "Побочные эффекты динамических изменений"
    ]
  },
  {
    "topic": "Performance Schema в MySQL",
    "description": "Инструменты Performance Schema для анализа производительности: профилирование этапов, диагностика параллелизма, анализ чтения/записи, отслеживание пользователей и транзакций репликации.",
    "subtopic": [
      "Диагностика задержек на этапах stage/sql/end из-за конкуренции за ресурсы (CPU, I/O, память)",
      "Ограничения профилирования: только общие этапы сервера, не подсистемы хранения",
      "Анализ типов операторов для оценки нагрузки чтения/записи (SELECT, INSERT, UPDATE и т.д.)",
      "Отслеживание пользователей через таблицу performance_schema.users и включение инструментов памяти",
      "Конфигурация Performance Schema: переменные по умолчанию, инструменты (instruments) и потребители (consumers)",
      "Анализ параллелизма и транзакций по потокам (events_transactions_summary_by_thread_by_event_name) для репликации"
    ]
  },
  {
    "topic": "Кэш потоков в MySQL",
    "description": "Механизм кэширования потоков соединений в MySQL для быстрого реагирования на новые подключения, управление переменной thread_cache_size и оптимизация производительности.",
    "subtopic": [
      "Принцип работы кэша: возврат потока при закрытии соединения",
      "Переменная thread_cache_size: определение и установка",
      "Условия кэширования и уничтожения потоков",
      "Влияние на новые соединения и производительность",
      "Расчет размера кэша и потребление памяти (~256 Кб на поток)",
      "Рекомендации по настройке для минимизации Thread_created"
    ]
  },
  {
    "topic": "Мониторинг в SRE для баз данных",
    "description": "Применение принципов проектирования надежности (SRE) для мониторинга инфраструктуры БД: отслеживание SLI/SLO, доступности, производительности и улучшение показателей для качества обслуживания клиентов.",
    "subtopic": [
      "Отслеживание изменений и тактических показателей производительности БД",
      "Постоянное улучшение SLI и SLO по мере роста бизнеса",
      "Выбор ключевых показателей (SLI) для измерения клиентского опыта",
      "Определение реалистичных целей уровня обслуживания (SLO)",
      "Мониторинг доступности как основы доверия клиентов",
      "Примеры SLI для интернет-магазина: скорость запросов и отсутствие ошибок"
    ]
  },
  {
    "topic": "Мониторинг перегрузки MySQL",
    "description": "Ключевые индикаторы и стратегии мониторинга для выявления перегрузки сервера MySQL, включая Threads_running, max_connections, штормы подключений и задержки запросов.",
    "subtopic": [
      "Проверка Threads_running относительно количества ядер CPU",
      "Мониторинг threads_connected / max_connections в процентах",
      "Выявление штормов подключений и их последствий",
      "Отслеживание задержек запросов и нагрузки на CPU/память",
      "Тактические решения: использование pt-kill и анализ запросов",
      "Обработка ошибок 'Too many connections' и 'Cannot create thread'",
      "Проактивный мониторинг для обеспечения SLO"
    ]
  },
  {
    "topic": "Мониторинг дискового пространства и I/O в БД",
    "description": "Изучение влияния дисковых операций на производительность баз данных, отслеживание использования пространства, задержек I/O и предотвращение узких мест для оптимизации нагрузки.",
    "subtopic": [
      "Влияние задержек диска на стоимость и время выполнения запросов",
      "Оценка ресурсов: CPU, скорость чтения/записи, пропускная способность диска и сети",
      "Рабочая нагрузка: сочетание запросов, задержек и масштабирование",
      "Мониторинг соотношения производительности чтения и записи",
      "Настройка оповещений о заполнении диска (оптимальные пороги)",
      "Отслеживание роста использования дискового пространства",
      "Мониторинг операций I/O для предотвращения bottleneck",
      "Автоматизация расширения дисков при критическом заполнении",
      "Определение частоты проверок дискового пространства"
    ]
  },
  {
    "topic": "Интерпретация vmstat и iostat",
    "description": "Руководство по анализу вывода утилит vmstat и iostat для диагностики нагрузки на CPU, память и I/O в Unix-подобных системах, включая ключевые метрики и формулы.",
    "subtopic": [
      "Запуск vmstat: опции (-SM 5), структура отчета (procs, memory, swap, io, system, cpu)",
      "Ключевые метрики CPU в vmstat: us, sy, id, wa, st (включая 'украденное' время в виртуализации)",
      "Запуск iostat: опции (-dxk 5), структура отчета (rrqm/s, wrqm/s, r/s, w/s, rkB/s, wkB/s, avgrq-sz, avgqu-sz, await, r_await, w_await, svctm, %util)",
      "Расчет concurrency: формула (r/s + w/s) * (svctm/1000)",
      "Интерпретация отчетов: игнорирование первой строки (средние с загрузки), фокус на инкрементных значениях",
      "Другие инструменты: mpstat, sar, ifconfig, netstat",
      "Советы: чтение man-страниц, ограничения инструментов (единицы, интервалы опроса)"
    ]
  },
  {
    "topic": "Оптимизация сервера MySQL",
    "description": "Руководство по настройке конфигурации MySQL для максимальной производительности: от аппаратных рекомендаций и ОС до параметров памяти, I/O и устранения bottleneck.",
    "subtopic": [
      "Рекомендации по аппаратному обеспечению (HDD vs SSD, объемы хранения)",
      "Настройки операционной системы (XFS, swap, планировщик дисков, сеть, SELinux)",
      "Анализ ограничений производительности (CPU и I/O bottleneck)",
      "Понимание внутреннего устройства и поведения MySQL",
      "Создание индивидуального конфигурационного файла",
      "Настройка thread cache и распределения памяти",
      "Оптимизация параметров ввода/вывода (синхронизация, безопасность vs производительность)"
    ]
  },
  {
    "topic": "Флеш-память и SSD",
    "description": "Обзор характеристик флеш-памяти в твердотельных накопителях, их преимуществ над HDD, ограничений записи и механизмов оптимизации для устойчивой работы.",
    "subtopic": [
      "Преимущества SSD над HDD: произвольный и последовательный I/O, параллелизм",
      "Характеристики флеш-памяти: быстрое чтение, сложная запись и стирание блоками",
      "Ограничения флеш-памяти: циклы стирания, износ ячеек и усиление записи",
      "Механизмы оптимизации: выравнивание износа, сборка мусора, перемещение страниц",
      "Архитектура SSD: FTL, кэширование, микропрограммное обеспечение и драйверы"
    ]
  },
  {
    "topic": "Оптимизация RAID",
    "description": "Анализ проблем производительности RAID 5, преимуществ RAID 0/1/10 и SSD, а также рекомендации по настройке размера фрагмента и кэша контроллера для серверов баз данных.",
    "subtopic": [
      "Проблемы RAID 5: масштабируемость, перестроение и зависимость от кэша",
      "Преимущества SSD: I/O, пропускная способность и произвольный доступ",
      "Упреждающее чтение и роль RAID-кэша",
      "Конфигурация размера фрагмента для чередования",
      "Производительность RAID 0, 1 и 10",
      "Настройка распределения кэша контроллера (write-back vs read caching)"
    ]
  },
  {
    "topic": "Оптимизация ввода/вывода InnoDB",
    "description": "Настройка параметров InnoDB в MySQL для улучшения производительности: журналы транзакций, буферы, сброс данных и управление табличным пространством.",
    "subtopic": [
      "Журнал транзакций InnoDB",
      "Буфер журнала и его сброс",
      "Параметр innodb_flush_method",
      "Размер файла журнала (innodb_log_file_size, innodb_log_files_in_group)",
      "innodb_dedicated_server и автоматическая настройка",
      "innodb_file_per_table и табличное пространство",
      "Старые версии строк и процесс очистки (innodb_purge_threads, innodb_purge_batch_size)"
    ]
  },
  {
    "topic": "Репликация в MySQL",
    "description": "Обзор механизма репликации в MySQL: принципы работы, отложенная и многопоточная репликация, отказоустойчивость, распространенные проблемы и их решения.",
    "subtopic": [
      "Обзор репликации: принципы синхронизации данных через двоичный журнал",
      "Отказоустойчивость репликации: использование копий для восстановления после сбоев",
      "Отложенная репликация: исключение отложенных реплик из кандидатов на failover",
      "Многопоточная репликация: параллельное применение SQL-команд, проблемы и риски",
      "Распространенные проблемы репликации: проявления, диагностика и решения",
      "Рекомендуемые топологии: один источник для записи, реплики для чтения"
    ]
  },
  {
    "topic": "Топологии репликации",
    "description": "Обзор топологий репликации баз данных: конфигурации источников и реплик, избыточность, failover и продвинутые сценарии для масштабирования.",
    "subtopic": [
      "Источник с несколькими репликами: идентичные конфигурации и избыточность n+2",
      "Источник с пулом чтения: оптимизация пропускной способности и стратегии",
      "Активный/пассивный: маршрутизация трафика и пассивные реплики",
      "Два источника с репликами: устранение проблем активный/активный",
      "Топология кольцевой репликации",
      "Репликация с несколькими источниками: обработка исключительных случаев"
    ]
  },
  {
    "topic": "Пулы чтения и балансировка нагрузки",
    "description": "Стратегии управления репликами чтения в базах данных: баланс нагрузки, health checks, обработка задержек репликации и оптимизация пулов для минимизации latency.",
    "subtopic": [
      "Влияние нагрузки на CPU и переключение контекста: баланс задержки и использования",
      "Толерантность к устаревшим данным в пуле чтения",
      "Проверки работоспособности (health checks): критерии (replication lag, read_only, query latency)",
      "Удаление отстающих реплик и резервные пулы",
      "Алгоритмы балансировки нагрузки и сегментация реплик",
      "Исключение реплик для тяжелых задач (отчеты, бэкапы)",
      "Вопросы для команд разработчиков по допустимому устареванию данных",
      "Рекомендации по архитектуре: минимум 3 реплики + бэкап/отчетность",
      "Сервисы обнаружения сбоев и их гарантии"
    ]
  },
  {
    "topic": "Резервное копирование MySQL",
    "description": "Проектирование системы резервного копирования и восстановления данных MySQL: от определения RPO/RTO до рекомендаций по типам бэкапов и тестированию.",
    "subtopic": [
      "Проблемы с бэкапами у хостинг-провайдеров",
      "Определение требований к восстановлению (RPO и RTO)",
      "Важность регулярного тестирования восстановления",
      "Шаги восстановления из резервной копии",
      "Преимущества полных резервных копий над инкрементными",
      "Рекомендации по хранению бэкапов (ZFS и избыточность)",
      "Проектирование решения для бэкапа MySQL"
    ]
  },
  {
    "topic": "Резервное копирование и восстановление в MySQL",
    "description": "Сравнение физических и логических методов резервного копирования данных MySQL: преимущества, недостатки, инструменты (mysqldump, Percona XtraBackup) и рекомендации по выбору в зависимости от размера БД.",
    "subtopic": [
      "Различия между физическими и логическими резервными копиями",
      "Преимущества физических копий: переносимость, скорость восстановления, многопоточность",
      "Недостатки физических копий: сложность восстановления, риски повреждений данных",
      "Логические копии с mysqldump: простота, надежность при сбоях дисков, но медленность для больших БД",
      "Инструменты для физического копирования: Percona XtraBackup, MySQL Enterprise Backup",
      "Рекомендации: физическое для больших БД, логическое для малых; сохранять несколько поколений и логическую копию как страховку"
    ]
  },
  {
    "topic": "Резервное копирование MySQL с LVM",
    "description": "Метод создания моментальных снимков (snapshots) баз данных MySQL с помощью LVM для быстрого бэкапа без блокировок, включая принципы работы, планирование, создание, монтирование и мониторинг.",
    "subtopic": [
      "Планирование резервного копирования: выделение места для снимка",
      "Разница между моментальным снимком и резервной копией",
      "Мифы о снимках LVM: как работает copy-on-write (COW)",
      "Создание снимка MySQL без или с минимальной блокировкой",
      "Просмотр состояния снимка с помощью команды lvs",
      "Монтирование снимка и копирование файлов",
      "Мониторинг снимка для предотвращения переполнения"
    ]
  },
  {
    "topic": "Percona XtraBackup: Резервное копирование и восстановление",
    "description": "Обзор принципов работы Percona XtraBackup на базе InnoDB crash recovery, создание полных и инкрементных резервных копий MySQL, а также процесс восстановления данных.",
    "subtopic": [
      "Как работает XtraBackup (InnoDB crash recovery и LSN)",
      "Создание базовой полной резервной копии (--backup --target-dir)",
      "Работа с потоковым копированием (xbstream)",
      "Восстановление из резервной копии (распаковка и применение)",
      "Инкрементные резервные копии и продвинутые методы",
      "Рекомендации по тестированию и использованию"
    ]
  },
  {
    "topic": "Масштабирование MySQL",
    "description": "Стратегии масштабирования операций чтения и записи в кластерах MySQL: пулы реплик, очереди, сегментация данных, вертикальное и горизонтальное масштабирование.",
    "subtopic": [
      "Что такое масштабируемость системы",
      "Масштабирование чтения с помощью пулов реплик",
      "Стратегии балансировки нагрузки (наименьшее количество соединений, самый быстрый ответ)",
      "Масштабирование записи: постановка в очередь для предсказуемости",
      "Сегментация данных для параллельной записи",
      "Вертикальное и горизонтальное масштабирование",
      "Разделение таблиц на функциональные кластеры",
      "Инструменты: ProxySQL и Vitess"
    ]
  },
  {
    "topic": "Масштабируемость MySQL",
    "description": "Объяснение понятий масштабируемости, производительности, пропускной способности и мощности систем на примере MySQL с аналогией шоссе и автомобилей.",
    "subtopic": [
      "Аналогия с шоссе: производительность как скорость, пропускная способность как полосы × скорость, масштабируемость как добавление машин и полос без замедления",
      "Определение масштабируемости: возможность роста производительности за счет добавления ресурсов независимо от базовой мощности",
      "Факторы масштабируемости: удобство, поломки, происшествия, смена полос и скорости",
      "Критерии оценки: стоимость и простота масштабирования (избегать чрезмерных затрат и сложности)",
      "Мощность (capacity): максимальный объем работы за единицу времени, способность обрабатывать нагрузку",
      "Отношение к MySQL и приложениям: архитектура БД может быть масштабируемой, но приложение — нет"
    ]
  },
  {
    "topic": "Шардирование в MySQL",
    "description": "Стратегии шардирования данных для масштабирования MySQL: выбор ключей сегментирования, балансировка шардов, оптимизация запросов и работа с несколькими ключами.",
    "subtopic": [
      "Выбор ключа сегментирования для минимизации запросов к нескольким шардам",
      "Балансировка шардов: равномерность и группировка для равного распределения данных",
      "Оптимизация запросов к нескольким шардам с использованием кэширования",
      "Работа со сложными моделями данных и несколькими ключами сегментирования",
      "Примеры шардирования: по штатам, кодам графств или телефонным кодам",
      "Хранение данных в нескольких видах для поддержки разных типов запросов"
    ]
  },
  {
    "topic": "Vitess для масштабирования MySQL",
    "description": "Vitess — система кластеризации MySQL для горизонтального шардирования, управления топологией, отказоустойчивостью и оптимизации доступа к базам данных.",
    "subtopic": [
      "Основные компоненты: Vitess pod, VTGate, VTTablet, vtctl",
      "Функции Vitess: шардирование, управление топологией, изменения схемы, пулинг соединений",
      "Шаги развертывания и масштабирования: настройка vttablet, переход на vtgate, запуск шардирования",
      "Горизонтальное шардирование данных и выбор ключа сегментирования",
      "История Vitess, преимущества и сложности внедрения"
    ]
  },
  {
    "topic": "ProxySQL для MySQL",
    "description": "ProxySQL — мощный прокси-сервер для MySQL, обеспечивающий маршрутизацию запросов, управление соединениями, поддержку шардирования, TLS, кэширование и защиту от пиковых нагрузок для масштабирования баз данных.",
    "subtopic": [
      "Маршрутизация запросов по порту, пользователю или регулярным выражениям",
      "Поддержка TLS для клиентских и серверных соединений",
      "Совместимость с версиями MySQL (AWS Aurora, Galera Cluster, ClickHouse)",
      "Дополнительные функции: зеркалирование, кэширование, перезапись запросов, аудит",
      "Управление соединениями: пулинг, изоляция клиентских и серверных подключений",
      "Защита от пиковых нагрузок и масштабирование приложений",
      "Шардирование: маршрутизация по схемам и пользователям",
      "Кластеризация ProxySQL для высокой доступности"
    ]
  },
  {
    "topic": "Управление изменениями схемы MySQL",
    "description": "Обзор инструментов, практик версионного контроля, CI/CD конвейеров и методов минимизации простоя при изменениях схемы базы данных MySQL.",
    "subtopic": [
      "Конвейер CI/CD для изменений схемы",
      "Управление версиями схемы базы данных",
      "Нативные DDL-изменения: INPLACE и INSTANT",
      "Обработка сложных изменений (первичные ключи, внешние ключи, шифрование)",
      "Внешние инструменты для онлайн-изменений без простоя (gh-ost и др.)",
      "Безопасность и дизайн: отказ от внешних ключей, хуки и тестирование",
      "Коммерческие решения для управления схемой"
    ]
  },
  {
    "topic": "Обновление MySQL 8.0",
    "description": "Руководство по причинам, тестированию и процессу безопасного обновления MySQL версии 8.0, включая ограничения на понижение версий и минимизацию рисков.",
    "subtopic": [
      "Причины обновления MySQL (исправление ошибок, новые функции)",
      "Ограничения версий: невозможность понижения точечных релизов в 8.0+",
      "Тестирование обновлений (примечания к выпуску, рабочая нагрузка, конфигурационные файлы)",
      "Тестирование в среде разработки",
      "Очистка времени простоя и вывод сервера из режима простоя",
      "Процесс обновления: обновление только необновленных узлов",
      "Перезапуск mysqld и проверка конфигурации"
    ]
  },
  {
    "topic": "MySQL в облаке",
    "description": "Обзор управляемой MySQL и развертывания MySQL на виртуальных машинах в облаке: возможности, сравнение подходов, создание VM, операционные аспекты и стратегии масштабирования.",
    "subtopic": [
      "Возможности и преимущества управляемой MySQL",
      "Недостатки управляемой MySQL (контроль, observability, поддержка)",
      "Развертывание MySQL на виртуальных машинах (аналог bare metal)",
      "Создание виртуальной машины: выбор спецификаций и типов дисков",
      "Операционные сложности (перезагрузка хоста, репликация, шардирование)",
      "Сравнение managed MySQL и self-managed на VM",
      "Мониторинг ошибок и новостей облачных провайдеров"
    ]
  },
  {
    "topic": "Amazon Aurora MySQL",
    "description": "Управляемая база данных совместимая с MySQL в AWS: бессерверный режим, глобальная репликация, особенности кластера, компромиссы и сравнение с другими облачными решениями.",
    "subtopic": [
      "Бессерверный режим Aurora MySQL (Serverless)",
      "Глобальная база данных Aurora",
      "Репликация внутри кластера (патентованная технология Amazon)",
      "Поддержка двоичных журналов",
      "Использование Amazon RDS Proxy для критически важных БД",
      "Ограничения: топологии, резервное копирование и восстановление",
      "Компромиссы: доступность, репликация и производительность",
      "Сравнение с другими управляемыми MySQL (GCP Cloud SQL и др.)",
      "Преимущества управляемых решений в облаке"
    ]
  },
  {
    "topic": "MySQL на Kubernetes",
    "description": "Введение в развертывание MySQL как нагрузки с сохранением состояния в Kubernetes: планирование ресурсов, преодоление страхов, лучшие практики и постепенное внедрение.",
    "subtopic": [
      "Определение целей и ожиданий от плоскости управления Kubernetes",
      "Выделение ресурсов для MySQL: размер данных и максимальные пределы",
      "Разбор страхов и сомнений по запуску MySQL на Kubernetes",
      "Эволюция управления ресурсами: от индивидуальных стеков к Kubernetes",
      "Взаимопонимание с командой Kubernetes для SLO и операционной модели",
      "Рекомендации по внедрению: начинать с stateless нагрузок и малых данных",
      "Инвестиции в проверенные решения (например, Vitess) для stateful нагрузок"
    ]
  },
  {
    "topic": "JSON vs SQL схемы в MySQL",
    "description": "Сравнение хранения данных в JSON-столбце и отдельных реляционных столбцах: размер, скорость запросов, индексация на примере данных астероидов NASA.",
    "subtopic": [
      "Подготовка данных: набор околоземных астероидов от NASA",
      "Создание JSON-таблицы (asteroids_json) с одним столбцом json_data",
      "Создание SQL-таблицы (asteroids_sql) с отдельными столбцами по типам данных",
      "Сравнение размера хранения данных (JSON: 81 КБ, SQL: 49 КБ)",
      "Скорость выполнения полных запросов (JSON ~0.8 мс, SQL ~0.4 мс)",
      "Индексация SQL-таблицы и поиск одной строки (0.33 мс)",
      "Сгенерированные столбцы и индексация в JSON-таблице (поиск ~0.4 мс)",
      "Выводы: преимущества реляционных схем, но JSON с индексами близок"
    ]
  },
  {
    "topic": "Пространственные данные в СУБД",
    "description": "Основы работы с пространственными данными в MySQL и PostGIS: типы объектов, создание, преобразование форматов, операции и анализ на базе стандартов OGC.",
    "subtopic": [
      "Типы пространственных данных (GEOMETRY, POINT, LINESTRING, POLYGON)",
      "Создание геометрических объектов из WKT, GeoJSON, GML (ST_GeomFromText, ST_LineFromText)",
      "Преобразование геометрии в текстовые форматы (ST_AsText, ST_AsGeoJSON, ST_AsGML)",
      "Пространственные операции (ST_Union, ST_Difference, ST_SymDifference)",
      "Пространственные отношения и анализ объектов",
      "Примеры запросов и использование в базах данных (sakila)"
    ]
  },
  {
    "topic": "Теорема CAP",
    "description": "Обзор теоремы CAP в распределённых системах: свойства согласованности, доступности и устойчивости к разделению, классы систем (CA, CP, AP), альтернативы (PACELC, BASE) и критика.",
    "subtopic": [
      "Определение теоремы CAP и её свойства (Consistency, Availability, Partition Tolerance)",
      "Классы распределённых систем: CA, CP, AP",
      "Примеры CA-систем (LDAP, реляционные БД) и требования ACID",
      "Альтернативный подход PACELC: выбор между C/A при разделении и C/L в нормальном режиме",
      "Подход BASE: Basically Available, Soft-state, Eventually consistent (примеры: CouchDB, Cassandra, DynamoDB)",
      "Критика CAP-теоремы и её упрощения"
    ]
  },
  {
    "topic": "Транзакции и масштабирование в MongoDB",
    "description": "Обзор поддержки транзакций ACID, горизонтального масштабирования через шардинг, агрегации данных, представлений и связанных ограничений в MongoDB.",
    "subtopic": [
      "Основные понятия: документы как единицы данных",
      "Денормализация и ограничения размера документов (16 Мб)",
      "Оператор $lookup и его ограничения на шардированных коллекциях",
      "Поддержка транзакций ACID: атомарность, согласованность, изолированность, надежность",
      "Работа с сессиями: startTransaction, commitTransaction, abortTransaction",
      "API для транзакций (с версии 4.2) и обработка ошибок",
      "Репликация: второстепенные реплики для чтения",
      "Горизонтальное масштабирование через шардинг (сегментирование)",
      "Агрегация данных: пайплайны, аналог GROUP BY, MapReduce",
      "Представления (Views): создание, только для чтения, преимущества",
      "Примеры транзакций на коллекциях zips и inventory",
      "Требования к реплика-сетам для транзакций и достоинства MongoDB"
    ]
  },
  {
    "topic": "Агрегация и обновление документов в MongoDB",
    "description": "Обзор методов подсчета, distinct, поиска с фильтрами, конвейера агрегации (стадии $match, $limit, $lookup) и операций обновления документов (updateOne, updateMany, replaceOne).",
    "subtopic": [
      "Методы подсчета документов (count, estimatedDocumentCount)",
      "Получение уникальных значений (distinct)",
      "Поиск и фильтрация документов (find с query)",
      "Конвейер агрегации (aggregate, стадии: $match, $limit, $lookup)",
      "Обновление документов (updateOne, updateMany, replaceOne)"
    ]
  },
  {
    "topic": "Большие данные (Big Data)",
    "description": "Введение в понятие больших данных: характеристики (3V/4V), инструменты обработки (NoSQL, Hadoop), источники, объемы и применения в различных сферах жизни и экономики.",
    "subtopic": [
      "Понятие и характеристики больших данных (volume, velocity, variety, veracity)",
      "Объемы и источники данных (IoT, социальные сети, медицина, астрономия, COVID-19 влияние)",
      "Инструменты обработки: NoSQL, MapReduce, Hadoop и горизонтальная масштабируемость",
      "Применение в сферах: здравоохранение, промышленность, торговля, управление, IoT",
      "Эволюция баз данных: от реляционных (SQL, MySQL, PostgreSQL) к NoSQL (MongoDB) и Big Data"
    ]
  },
  {
    "topic": "Архитектуры обработки больших данных",
    "description": "Обзор пакетной, потоковой обработки данных и лямбда-архитектуры, включая ключевые компоненты: прием сообщений, хранение, анализ и инструменты вроде MapReduce, Kafka, Storm.",
    "subtopic": [
      "Пакетная обработка данных (Batch processing с MapReduce)",
      "Прием сообщений в реальном времени (Real-time message ingestion с Kafka, RabbitMQ)",
      "Потоковая обработка данных (Stream processing с Storm, Spark Streaming)",
      "Хранилище аналитических данных (Analytical data store)",
      "Анализ и создание отчетов (Analytics and reporting)",
      "Оркестрация процессов (Orchestration)",
      "Лямбда-архитектура (Lambda architecture: комбинация пакетной и потоковой обработки)"
    ]
  },
  {
    "topic": "Экосистема Hadoop, Spark и Kafka",
    "description": "Обзор ключевых технологий для распределённой обработки больших данных: Hadoop (HDFS, MapReduce, YARN), Spark (обработка в памяти, компоненты) и Kafka (система обмена сообщениями pub-sub).",
    "subtopic": [
      "Основные компоненты Apache Hadoop: HDFS, MapReduce, YARN",
      "Цели и преимущества Hadoop: надежность, отказоустойчивость, масштабируемость",
      "Экосистема Hadoop: Hive, HBase, Mahout",
      "Архитектура Apache Spark: резидентные вычисления в памяти, поддержка языков Java, Scala, Python, R",
      "Компоненты Spark: Spark SQL, Spark Streaming (micro-batch), Spark MLlib, GraphX",
      "Интеграция Spark с Hadoop: YARN, HDFS, Cassandra, S3",
      "Особенности Apache Kafka: распределённая pub-sub система, горизонтальное масштабирование, отказоустойчивость",
      "Применение Kafka для потоков данных и пакетной обработки"
    ]
  },
  {
    "topic": "Соответствие MySQL нормативным требованиям",
    "description": "Обзор ключевых элементов контроля соответствия в MySQL: отслеживание изменений, аудит доступа, автоматизация задач и защита данных для нормативов вроде PCI, HIPAA и финансовой отчетности.",
    "subtopic": [
      "Ограничение ущерба от утечек секретов и быстрая ротация ключей",
      "Отслеживание изменений в данных и схемах баз данных",
      "Контроль изменений схемы в производственной среде",
      "Автоматизация отслеживания изменений для compliance",
      "Ведение журналов доступа к конфиденциальным данным",
      "Использование плагинов аудита: Percona Audit Log и MySQL Enterprise Audit",
      "Защита резервных копий и предотвращение утечек",
      "Роль DBA в интеграции compliance в архитектуру данных"
    ]
  },
  {
    "topic": "Соответствие MySQL нормативным требованиям",
    "description": "Обзор инструментов и практик для обеспечения compliance в MySQL: плагин аудита Percona, управление версиями схемы, удаление неактивных пользователей и преимущества над триггерами.",
    "subtopic": [
      "Настройка подключаемого модуля журнала аудита Percona",
      "Отслеживание операторов и управление конфигурацией плагина",
      "Мониторинг состояния плагина с помощью запросов",
      "Управление версиями изменений схемы для compliance",
      "Удаление неактивных пользователей на основе логов аудита",
      "Преимущества плагина Percona над триггерами"
    ]
  },
  {
    "topic": "Карьера в управлении базами данных",
    "description": "Уроки из благодарностей авторов 'High Performance MySQL' (4-е издание): роль наставников, семьи, сообщества и опыта в компаниях для успеха в IT и DBA.",
    "subtopic": [
      "Наставники и команды (Laine Campbell, PalominoDB, Pythian, Baron Schwartz)",
      "Семейная поддержка и личные жертвы (родители, супруги)",
      "Карьерный путь: иммиграция, образование и первые вызовы",
      "Сообщество женщин в tech и влияющие книги (Camille Fournier, Nicole Forsgren)",
      "Опыт в компаниях (SendGrid, Twilio: репликация MySQL, оптимизация очередей)",
      "Роль рецензентов, редакторов и feedback"
    ]
  }
]