[[
  {
    "topic": "Основы баз данных",
    "description": "Введение в понятие баз данных: определения, характеристики, этапы развития, модели данных (реляционная, объектная), проектирование и ключевые технологии (SQL, транзакции).",
    "subtopic": [
      "Определение базы данных (по ГК РФ, ГОСТу и другим источникам)",
      "Характеристики баз данных (структурированность, метаданные, самодокументирование, схема)",
      "Этапы развития баз данных (от файловых систем до объектно-реляционных)",
      "Основные модели данных (реляционная, объектная, слабоструктурированные данные)",
      "Проектирование баз данных",
      "Реляционная модель и SQL",
      "Представления, индексы и процедурные расширения SQL",
      "Управление транзакциями"
    ]
  },
  {
    "topic": "История и особенности SQL",
    "description": "Обзор эволюции SQL как декларативного языка для реляционных БД: от базовых операций до стандартов, диалектов, преимуществ и недостатков.",
    "subtopic": [
      "Изначальные операции SQL: создание таблиц, добавление/изменение/удаление записей, выборка данных и изменение структуры",
      "Эволюция SQL: усложнение языка, поддержка хранимых объектов (индексы, представления, триггеры, процедуры)",
      "Стандартизация SQL: ANSI/ISO 1986, SQL:92 и последующие версии",
      "Диалекты SQL: различия между СУБД, несовместимость и отступления от стандартов",
      "Преимущества SQL: независимость от СУБД, наличие стандартов, декларативность",
      "Недостатки SQL: сложность переноса, проблемы с иерархическими структурами"
    ]
  },
  {
    "topic": "Иерархическая и сетевая модели баз данных",
    "description": "Обзор структур, преимуществ, недостатков и сравнений иерархической (древовидной) и сетевой (графовой) моделей баз данных, их поддержки связей 'один ко многим' и 'многие ко многим'.",
    "subtopic": [
      "Определение иерархической модели: древовидная структура с связью 'один ко многим'",
      "Преимущества иерархической модели: простота понимания, эффективность поиска, контролируемый доступ",
      "Недостатки иерархической модели: отсутствие поддержки 'многие ко многим', проблемы с удалением и модификацией",
      "Определение сетевой модели: графовая структура с множественными связями",
      "Преимущества сетевой модели: поддержка 'многие ко многим', гибкость связей, точное отражение реального мира",
      "Сравнение с системами файлов и другими моделями (документо-ориентированными)"
    ]
  },
  {
    "topic": "Реляционная модель баз данных",
    "description": "Обзор реляционной модели данных: преимущества, недостатки, сравнение с иерархической и сетевой моделями, основные понятия и примеры.",
    "subtopic": [
      "Недостатки иерархической и сетевой моделей",
      "Введение реляционной модели и её принципы",
      "Преимущества реляционной модели (структурированность, SQL, эффективность операций)",
      "Недостатки реляционной модели (потеря соответствия, сложность масштабирования)",
      "Основные понятия: тип данных, домен, атрибут, кортеж, первичный ключ, отношение",
      "Пример отношения 'Сотрудники'"
    ]
  },
  {
    "topic": "Связи между кортежами отношений",
    "description": "Внешние ключи и типы связей (1:1, 1:N, N:M) в реляционной модели для реализации взаимодействий между сущностями.",
    "subtopic": [
      "Роль внешних ключей в связях между отношениями",
      "Тип связи «один к одному» и её свойства",
      "Тип связи «один ко многим» с примерами (отделы-сотрудники)",
      "Тип связи «многие ко многим» и промежуточные таблицы (фильмы-актеры)",
      "Свойства внешних ключей: простые/составные, домены, уникальность",
      "Нормализация и разбиение таблиц для оптимизации"
    ]
  },
  {
    "topic": "Операции реляционной алгебры",
    "description": "Основные реляционные операции: объединение, вычитание, пересечение, декартово произведение, деление и соединение с примерами на таблицах студентов, дисциплин и преподавателей.",
    "subtopic": [
      "Объединение (Union): объединение кортежей из двух отношений с удалением дубликатов",
      "Вычитание (Difference): кортежи из первого отношения, отсутствующие во втором",
      "Пересечение (Intersection): кортежи, присутствующие в обоих отношениях",
      "Декартово произведение (Cartesian Product): все возможные комбинации строк из двух таблиц",
      "Деление (Division): результат содержит столбцы, отсутствующие в делителе",
      "Соединение (Join): конкатенация кортежей по заданному условию (расширенное декартово произведение с фильтрацией)"
    ]
  },
  {
    "topic": "Разработка ER-диаграмм",
    "description": "Процесс создания концептуальной и физической ER-моделей для базы данных на примере системы оптовой торговли: выделение сущностей (покупатель, накладная, товар, склад), атрибутов, связей, нормализация и переход к таблицам СУБД.",
    "subtopic": [
      "Выделение сущностей и атрибутов предметной области",
      "Определение связей между сущностями (один-ко-многим, многие-ко-многим, модальность)",
      "Разделение связей многие-ко-многим с помощью промежуточных сущностей",
      "Итеративное уточнение концептуальной ER-диаграммы",
      "Создание физической ER-диаграммы в MySQL Workbench (типы данных, внешние ключи)",
      "Нормализация отношений и устранение избыточности данных"
    ]
  },
  {
    "topic": "Целостность сущностей",
    "description": "Фундаментальные свойства реляционных отношений: отсутствие дубликатов, упорядоченности, уникальность строк через первичный ключ без NULL, проблемы трехзначной логики и неадекватности модели.",
    "subtopic": [
      "Проблемы дубликатов данных и их влияние на редактирование/обновление",
      "Отсутствие упорядоченности кортежей",
      "Трехзначная логика и нарушение принципа исключенного третьего",
      "Уникальность атрибутов для идентификации кортежей",
      "Требования к первичному ключу: запрет NULL",
      "Последствия нарушения целостности сущностей"
    ]
  },
  {
    "topic": "Ссылочная целостность",
    "description": "Правила обеспечения согласованности внешних ключей в реляционных БД: внешние ключи в дочернем отношении должны ссылаться на существующие кортежи родительского; анализ нарушений при вставке, обновлении и удалении кортежей.",
    "subtopic": [
      "Определение ссылочной целостности и правило внешних ключей",
      "Характеристики внешних ключей: один-ко-многим, NULL-значения, отсутствие требования к потенциальному ключу",
      "Родительское отношение: вставка кортежа (не нарушает)",
      "Родительское отношение: обновление кортежа (может нарушить)",
      "Родительское отношение: удаление кортежа (может нарушить)",
      "Дочернее отношение: вставка кортежа (может нарушить)",
      "Дочернее отношение: обновление кортежа (может нарушить)",
      "Дочернее отношение: удаление кортежа (может нарушить)"
    ]
  },
  {
    "topic": "Нормализация к 2НФ и 3НФ",
    "description": "Приведение реляционных таблиц ко второй и третьей нормальным формам путём анализа функциональных зависимостей, выявления потенциальных ключей и декомпозиции на примере отношения СОТРУДНИКИ_ОТДЕЛЫ_ПРОЕКТЫ.",
    "subtopic": [
      "Понятие потенциального ключа: простой и составной ключи",
      "Условия второй нормальной формы (2НФ): отсутствие зависимостей неключевых атрибутов от части составного ключа",
      "Анализ функциональных зависимостей в исходном отношении",
      "Декомпозиция отношения для достижения 2НФ (СОТРУДНИКИ_ОТДЕЛЫ, ПРОЕКТЫ, ЗАДАЧИ)",
      "Условия третьей нормальной формы (3НФ): отсутствие зависимостей между неключевыми атрибутами",
      "Декомпозиция для 3НФ (СОТРУДНИКИ и ОТДЕЛЫ)"
    ]
  },
  {
    "topic": "Ключевые функции СУБД",
    "description": "Основные задачи систем управления базами данных: обеспечение параллельного доступа, обработки транзакций, метаописания данных, надежности хранения и восстановления после сбоев.",
    "subtopic": [
      "Управление параллельностью и совместным доступом",
      "Обработка данных в рамках транзакции",
      "Метаописание данных и системный каталог",
      "Журнализация изменений, резервное копирование и восстановление"
    ]
  },
  {
    "topic": "Клиент-серверные СУБД",
    "description": "Обзор систем управления базами данных (СУБД), их компонентов, преимуществ клиент-серверной архитектуры, обработки SQL-запросов и сравнение с встраиваемыми СУБД.",
    "subtopic": [
      "Понятие и назначение СУБД",
      "Основные компоненты СУБД",
      "Роли пользователей: администраторы, программисты и конечные пользователи",
      "Архитектура клиент-серверных СУБД и отличие от 'файл-сервер'",
      "Обработка SQL-запросов и контроль доступа",
      "Преимущества клиент-серверных СУБД",
      "Недостатки и встраиваемые СУБД"
    ]
  },
  {
    "topic": "Создание таблиц в SQL",
    "description": "Основы команды CREATE TABLE: создание баз данных, таблиц с типами данных, атрибутами столбцов (PRIMARY KEY, AUTO_INCREMENT, DEFAULT, CHECK, NOT NULL, UNIQUE) и внешними ключами (FOREIGN KEY).",
    "subtopic": [
      "Создание базы данных (CREATE DATABASE) и выбор базы (USE)",
      "Базовое создание таблицы с типами данных (INT, VARCHAR)",
      "Первичный ключ (PRIMARY KEY AUTO_INCREMENT)",
      "Значение по умолчанию (DEFAULT)",
      "Ограничения на столбцы (CHECK, NOT NULL, UNIQUE)",
      "Ограничения на уровне таблицы (CHECK)",
      "Внешние ключи (FOREIGN KEY REFERENCES)",
      "Каскадные действия (ON DELETE, ON UPDATE)"
    ]
  },
  {
    "topic": "Числовые, логические и битовые типы данных в SQL",
    "description": "Обзор приближённых и точных числовых типов данных, логического типа с поддержкой NULL и битовых последовательностей для хранения двоичной информации в SQL.",
    "subtopic": [
      "Приближённые числовые типы (REAL, FLOAT[(n)], DOUBLE PRECISION)",
      "Точные числовые типы (NUMERIC[(n[,m])], DECIMAL[(n[,m])], BIGINT, INTEGER/INT, SMALLINT)",
      "Логический тип данных (TRUE/FALSE/NULL)",
      "Битовые последовательности (BIT фиксированной/переменной длины и для больших объектов)"
    ]
  },
  {
    "topic": "Переменные и строковые функции в SQL",
    "description": "Обзор переменных, строковых типов данных и встроенных функций для обработки строк, дат и времени в SQL.",
    "subtopic": [
      "Переменные: локальные, пользовательские и системные",
      "Объявление переменных с помощью DECLARE",
      "Строковые типы данных (CHARACTER VARYING, VARCHAR, NCHAR)",
      "Строковые функции (TRIM, UPPER, LOWER, POSITION, SUBSTRING, TRANSLATE)",
      "Функции длины и преобразования (BIT_LENGTH, CHAR_LENGTH, CAST)",
      "Функции даты и времени (CURRENT_DATE, CURRENT_TIME, CURRENT_TIMESTAMP)"
    ]
  },
  {
    "topic": "Продвинутые SQL-запросы: сортировка, фильтрация и группировка",
    "description": "Изучение операторов ORDER BY для сортировки, WHERE для фильтрации и соединения таблиц, GROUP BY и HAVING для группировки, а также псевдонимов с AS.",
    "subtopic": [
      "Сортировка данных с ORDER BY: по столбцам, выражениям, нескольким полям (ASC/DESC)",
      "Фильтрация строк с WHERE: условия отбора и соединение таблиц (implicit JOIN)",
      "Псевдонимы таблиц и столбцов с AS для упрощения запросов",
      "Группировка данных с GROUP BY и агрегатными функциями (COUNT, SUM и т.д.)",
      "Фильтрация групп с HAVING",
      "Комбинирование WHERE, GROUP BY, HAVING и ORDER BY в одном запросе"
    ]
  },
  {
    "topic": "Соединения JOIN в SQL",
    "description": "Обзор типов внешних и внутренних соединений таблиц в SQL: INNER JOIN, LEFT/RIGHT/FULL OUTER JOIN, NATURAL JOIN, USING, с примерами запросов, псевдонимами и фильтрацией.",
    "subtopic": [
      "Введение в JOIN: синтаксис и правила построения запросов",
      "INNER JOIN: пересечение данных двух таблиц",
      "LEFT OUTER JOIN: все строки левой таблицы с дополнением из правой (NULL для несвязанных)",
      "RIGHT OUTER JOIN: все строки правой таблицы с дополнением из левой (NULL для несвязанных)",
      "FULL OUTER JOIN: все строки из обеих таблиц с NULL для несвязанных",
      "NATURAL JOIN: автоматическое соединение по одноименным столбцам",
      "JOIN USING: соединение по указанному столбцу",
      "Псевдонимы таблиц для сокращения кода",
      "Анти-джойны: поиск несвязанных строк с WHERE ... IS NULL",
      "Комплексные запросы: фильтрация, сортировка и примеры на таблицах customers, orders, products"
    ]
  },
  {
    "topic": "Вложенные запросы в SQL",
    "description": "Изучение подзапросов (вложенных запросов) в SQL: их структура, типы, правила, операторы EXISTS, IN, ALL и ANY для эффективной фильтрации данных.",
    "subtopic": [
      "Определение и структура вложенных запросов",
      "Типы подзапросов: скалярные и табличные",
      "Правила и ограничения подзапросов",
      "Оператор EXISTS: синтаксис и примеры",
      "Сравнение EXISTS и IN по эффективности",
      "Многократное сравнение: операторы ALL, ANY и SOME"
    ]
  },
  {
    "topic": "Обновляемые представления в SQL",
    "description": "Условия создания обновляемых представлений, операции INSERT, UPDATE, DELETE на них с использованием WITH CHECK OPTION, а также команды манипуляции данными UPDATE, DELETE, TRUNCATE и DROP TABLE.",
    "subtopic": [
      "Условия обновляемости представлений (отсутствие агрегатов, DISTINCT, GROUP BY и т.д.)",
      "INSERT в обновляемые представления (для одной таблицы, значения по умолчанию)",
      "UPDATE в представлениях (с WHERE и CHECK OPTION)",
      "DELETE в представлениях (ограничения для multi-table)",
      "WITH CHECK OPTION (CASCADED и LOCAL)",
      "Пример создания обновляемого представления (apple_products)",
      "Команда UPDATE для таблиц и представлений",
      "Команда DELETE (с WHERE, отличия от TRUNCATE)",
      "TRUNCATE TABLE (быстрее DELETE, без rollback, обнуление автоинкремента)",
      "DROP TABLE для удаления таблицы"
    ]
  },
  {
    "topic": "Триггеры и хранимые процедуры в MySQL",
    "description": "Обзор триггеров для обеспечения целостности данных, их типов (BEFORE/AFTER), порядка выполнения, а также создания, модификации и удаления хранимых процедур и функций в MySQL.",
    "subtopic": [
      "Определение триггеров как автоматических хранимых процедур",
      "Типы триггеров: BEFORE/AFTER для INSERT, UPDATE, DELETE",
      "Порядок выполнения триггеров: FOLLOWS и PRECEDES",
      "Назначение триггеров для проверки целостности данных",
      "Синтаксис создания триггера в MySQL (CREATE TRIGGER)",
      "Создание хранимых процедур (CREATE PROCEDURE): параметры, характеристики",
      "Создание хранимых функций (CREATE FUNCTION): примеры с циклами и запросами",
      "Вызов функций в SELECT и отличие от процедур",
      "Модификация процедур и функций (ALTER PROCEDURE/FUNCTION)",
      "Удаление процедур и функций (DROP PROCEDURE/FUNCTION)"
    ]
  },
  {
    "topic": "Индексы в СУБД",
    "description": "Обзор механизмов индексирования данных в реляционных базах данных для ускорения поиска, с акцентом на типы индексов (хеш и B-дерево), их преимущества, недостатки и применение.",
    "subtopic": [
      "Что такое индекс и его роль в СУБД",
      "Типы индексов: первичный ключ, внешний ключ, пользовательские",
      "Преимущества и недостатки использования индексов",
      "Индексы на основе хеширования: принципы работы, плюсы и минусы",
      "Индексы на основе B-деревьев: сбалансированность, преимущества поиска и недостатки",
      "Другие типы индексов (пространственные, битовые, полнотекстовые)"
    ]
  },
  {
    "topic": "Проблемы изоляции транзакций",
    "description": "Проблемы совместного доступа к данным при параллельном выполнении транзакций (lost update, dirty read, non-repeatable read, phantom reads) и уровни изоляции (READ UNCOMMITTED, READ COMMITTED, SERIALIZABLE).",
    "subtopic": [
      "Потерянное обновление (lost update)",
      "Грязное чтение (dirty read)",
      "Неповторяющееся чтение (non-repeatable read)",
      "Фантомное чтение (phantom reads)",
      "Уровень READ UNCOMMITTED",
      "Уровень READ COMMITTED",
      "Уровень SERIALIZABLE и его особенности"
    ]
  },
  {
    "topic": "JSON в СУБД",
    "description": "Обзор типов данных JSON и JSONB в PostgreSQL и MySQL: различия, преимущества, элементы формата и хранение денормализованных данных без схемы.",
    "subtopic": [
      "Что такое JSON: формат, элементы и примеры документов",
      "Различия между типами json и jsonb в PostgreSQL",
      "Преимущества хранения данных без схемы и денормализация",
      "Работа с JSON в MySQL: тип данных, валидация и ограничения",
      "Индексация, производительность и сравнение с другими форматами (XML, двоичные)"
    ]
  },
  {
    "topic": "Пространственные данные в СУБД",
    "description": "Изучение типов данных, создания, преобразования, операций и анализа пространственных объектов в MySQL и PostGIS на основе стандартов OGC.",
    "subtopic": [
      "Пространственные расширения СУБД и стандарты OGC",
      "Типы данных: GEOMETRY, POINT, LINESTRING, POLYGON",
      "Создание геометрий из WKT, GeoJSON, GML (ST_GeomFromText, ST_LineFromText)",
      "Преобразование геометрий в текстовые форматы (ST_AsText, ST_AsGeoJSON)",
      "Операции над геометриями: ST_Union, ST_Difference, ST_SymDifference",
      "Пространственный анализ и отношения объектов",
      "Примеры запросов и работы с таблицами"
    ]
  },
  {
    "topic": "Основы MongoDB",
    "description": "Введение в документоориентированную NoSQL СУБД MongoDB: понятия, типы данных, денормализация, индексы и транзакции с поддержкой ACID.",
    "subtopic": [
      "Основные понятия: документ, коллекция, сравнение с реляционными СУБД",
      "Типы данных в документах (JSON-подобные и расширенные)",
      "Денормализация данных и ограничения (размер документа, $lookup)",
      "Создание индексов (направление, опции, commitQuorum)",
      "Транзакции: ACID-свойства, API (базовый и callback), сессии в mongo shell"
    ]
  },
  {
    "topic": "Агрегация и обновление документов в MongoDB",
    "description": "Методы агрегации данных (count, distinct, aggregate pipeline), фильтрация с find и обновление документов (updateOne, updateMany, replaceOne).",
    "subtopic": [
      "Простые методы агрегации: estimatedDocumentCount, count, distinct",
      "Поиск и фильтрация документов с методом find и операторами",
      "Конвейер агрегации: метод aggregate, этапы ($match, $limit, $lookup)",
      "Обновление документов: updateOne, updateMany, replaceOne",
      "Использование агрегации для обновления документов и геопространственные операторы"
    ]
  },
  {
    "topic": "Теорема CAP",
    "description": "Теорема CAP в распределённых системах: свойства согласованности, доступности и устойчивости к разделению, классы систем (CA, CP, AP), альтернативы (PACELC, BASE) и критика.",
    "subtopic": [
      "Формулировка теоремы CAP (Consistency, Availability, Partition Tolerance)",
      "Определение свойств: C (согласованность), A (доступность), P (устойчивость к разделению)",
      "Классы систем: CA, CP, AP с примерами (LDAP, реляционные БД, CouchDB, Cassandra)",
      "Альтернативные подходы: PACELC и BASE (Basically Available, Soft-state, Eventually consistent)",
      "Критика CAP-теоремы и её упрощения"
    ]
  },
  {
    "topic": "Большие данные (Big Data)",
    "description": "Обзор понятия больших данных: характеристики (3V-4V), принципы обработки, источники, применения в различных сферах и инструменты для работы с ними.",
    "subtopic": [
      "Определение и характеристики больших данных (volume, velocity, variety, veracity, variability, value)",
      "Базовые принципы работы: горизонтальная масштабируемость, отказоустойчивость, локальность данных",
      "Источники больших данных (IoT, социальные сети, медицина, астрономия, предприятия)",
      "Объемы и статистика данных в мире",
      "Применения в сферах: здравоохранение, промышленность, торговля, управление, IoT",
      "Инструменты обработки: NoSQL, MapReduce, Hadoop и реляционные СУБД"
    ]
  },
  {
    "topic": "Обработка больших данных: пакетная и потоковая",
    "description": "Обзор архитектур и инструментов для пакетной обработки (MapReduce, Hadoop), потоковой обработки в реальном времени (Kafka, Spark Streaming), лямбда-архитектуры и ключевых компонентов экосистемы больших данных.",
    "subtopic": [
      "Пакетная обработка данных с использованием MapReduce",
      "Прием сообщений в реальном времени (брокеры сообщений: Kafka, RabbitMQ)",
      "Потоковая обработка данных (фильтрация, статистика, Spark Streaming, Storm)",
      "Хранилище аналитических данных и создание отчетов",
      "Лямбда-архитектура: объединение пакетной и потоковой обработки",
      "Apache Hadoop: основы и компоненты",
      "Apache Spark: резидентная обработка в памяти",
      "Apache Kafka: распределенная система обмена сообщениями"
    ]
  }
]]